In [2]:
"""
    CASO O PANDAS OU OUTRA BIBLIOTECA UTILIZADA NÂO ESTEJAM INSTALADOS EXECUTE:
      #instalar Pandas 
        !pip install pandas
"""
#Importando o pandas para a aplicação:
import pandas as pd

#### Data Series X Data Frame

In [3]:
#Criando series
nomes = [
    'Thiago Gambati',
    'Manoel Neto',
    'Joesley Ferreira',
    'Ingrid Dandara'
]
indice = [0,1,2,3]
ex_series = pd.Series(nomes, indice, name = 'Nomes')
ex_series

0      Thiago Gambati
1         Manoel Neto
2    Joesley Ferreira
3      Ingrid Dandara
Name: Nomes, dtype: object

In [4]:
#Criando DataFrame
df = pd.DataFrame({
    "nome" : ['Thiago Gambati', 'Manoel Neto', 'Joesley Ferreira', 'Ingrid Dandara'], 
    "idade" : [22, 21, 23, 21],
    "faculdade" : ['Ciência da Computação', 'Educação Física', 'Arquitetura', 'Medicina Veterinária']
})
df

               nome  idade              faculdade
0    Thiago Gambati     22  Ciência da Computação
1       Manoel Neto     21        Educação Física
2  Joesley Ferreira     23            Arquitetura
3    Ingrid Dandara     21   Medicina Veterinária

In [5]:
#Obtendo coluna específica
df["faculdade"] #Toda coluna de um Data Frame é uma Data Series

0    Ciência da Computação
1          Educação Física
2              Arquitetura
3     Medicina Veterinária
Name: faculdade, dtype: object

#### Importando dados

In [6]:
#Salvando o arquivo em uma variável a ser trabalhada
dados = pd.read_csv(
    r"C:\Users\thiag\OneDrive\Documentos\Python Scripts\Formação DEX\Pandas\Arquivos da Aplicação\credit_card_clients.csv")
dados

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,29996,220000,1,3,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,29997,150000,1,3,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,29998,30000,1,2,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,29999,80000,1,3,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,30000,50000,1,2,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

Metadados do DataFrame:

   O conjunto de dados credit contém informações sobre pagamentos, fatores demográficos, dados de crédito, histórico de pagamentos e extratos de contas de clientes de cartão de crédito em Taiwan de abril de 2005 a setembro de 2005.

   O DataFrame contém 25 variáveis:

    ID: ID de cada cliente.

    LIMIT_BAL: Valor do crédito concedido em NT (New Taiwan) dólar (inclui crédito individual e familiar/complementar).

    SEXO: Gênero (1=masculino, 2=feminino).

    EDUCAÇÃO: (1 = pós-graduação, 2 = universidade, 3 = ensino médio, 4 = outros, 5 = desconhecido, 6 = desconhecido).

    CASAMENTO: Estado civil (1=casado, 2=solteiro, 3=outros).

    IDADE: Idade em anos.

    PAY_0: Status de pagamento em setembro de 2005 .(-1=pagamento devido, 1=atraso de pagamento por um mês, 2=atraso de pagamento por dois meses, … 8=atraso de pagamento por oito meses, 9=atraso de pagamento por nove meses e acima).

    PAY_2: Status de reembolso em agosto de 2005 (escala igual à acima).

    PAY_3: Status de reembolso em julho de 2005 (escala igual à acima).

    PAY_4: Status de reembolso em junho de 2005 (escala igual à acima).

    PAY_5: Status de reembolso em maio de 2005 (escala igual à acima).

    PAY_6: Status de reembolso em abril de 2005 (escala igual à acima).

    BILL_AMT1: Valor do extrato da conta em setembro de 2005 (dólar NT).

    BILL_AMT2: Valor do extrato da conta em agosto de 2005 (dólar NT).

    BILL_AMT3: Valor do extrato da conta em julho de 2005 (dólar NT).

    BILL_AMT4: Valor do extrato da conta em junho de 2005 (dólar NT).

    BILL_AMT5: Valor do extrato da conta em maio de 2005 (dólar NT).

    BILL_AMT6: Valor do extrato da conta em abril de 2005 (dólar NT).

    PAY_AMT1: Valor do pagamento anterior em setembro de 2005 (dólar NT).

    PAY_AMT2: Valor do pagamento anterior em agosto de 2005 (dólar NT).

    PAY_AMT3: Valor do pagamento anterior em julho de 2005 (dólar NT).

    PAY_AMT4: Valor do pagamento anterior em junho de 2005 (dólar NT).

    PAY_AMT5: Valor do pagamento anterior em maio de 2005 (dólar NT).

    PAY_AMT6: Valor do pagamento anterior em abril de 2005 (dólar NT).

    default.payment.next.month: Pagamento padrão (1=sim, 0=não).

#### Extraindo informações do DataFrame

In [7]:
#Mostrando informações das colunas
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  int64
 1   LIMIT_BAL                   30000 non-null  int64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_0                       30000 non-null  int64
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  int64
 13  BILL_AMT2                   30000 non-null  int64
 14  BILL_AMT3                   30000 non-null  int64
 15  BILL_AMT4                   30000 non-null  int64
 16  BILL_AMT5                   30000 non-null  int64
 17  BILL_AMT6                   30000 non-null  int64
 18  PAY_AMT1                    30000 non-null  int64
 19  PAY_AMT2                    30000 non-null  int64
 20  PAY_AMT3                    30000 non-null  int64
 21  PAY_AMT4                    30000 non-null  int64
 22  PAY_AMT5                    30000 non-null  int64
 23  PAY_AMT6                    30000 non-null  int64
 24  default payment next month  30000 non-null  int64
dtypes: int64(25)
memory usage: 5.7 MB

In [8]:
#Mostrando 7 primeiros registros do DataFrame
dados.head(7)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
5,6,50000,1,1,2,37,0,0,0,0,...,19394,19619,20024,2500,1815,657,1000,1000,800,0
6,7,500000,1,1,2,29,0,0,0,0,...,542653,483003,473944,55000,40000,38000,20239,13750,13770,0

In [9]:
#Mostrando 7 últimos registros do DataFrame
dados.tail(7)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
29993,29994,100000,1,1,2,38,0,-1,-1,0,...,70626,69473,55004,2000,111784,4000,3000,2000,2000,0
29994,29995,80000,1,2,2,34,2,2,2,2,...,77519,82607,81158,7000,3500,0,7000,0,4000,1
29995,29996,220000,1,3,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,29997,150000,1,3,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,29998,30000,1,2,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,29999,80000,1,3,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,30000,50000,1,2,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

In [10]:
#Consultando dimensões
dados.shape

(30000, 25)

In [11]:
#Renomeando colunas
dados_renamed = dados.rename(columns = {'LIMIT_BAL' : 'valor_credito',
                                        'SEX' : 'sexo',
                                        'EDUCATION' : 'escolaridade',
                                        'MARRIAGE':'estado_civil',
                                        'AGE':'idade',
                                        'PAY_0':'status_pag_set_2005',
                                        'PAY_2':'status_pag_ago_2005',
                                        'PAY_3':'status_pag_jul_2005',
                                        'PAY_4':'status_pag_jun_2005',
                                        'PAY_5':'status_pag_mai_2005',
                                        'PAY_6':'status_pag_abr_2005',
                                        'BILL_AMT1':'extrato_set_2005',
                                        'BILL_AMT2':'extrato_ago_2005',
                                        'BILL_AMT3':'extrato_jul_2005',
                                        'BILL_AMT4':'extrato_jun_2005',
                                        'BILL_AMT5':'extrato_mai_2005',
                                        'BILL_AMT6':'extrato_abr_2005',
                                        'PAY_AMT1':'valor_pag_set_2005',
                                        'PAY_AMT2':'valor_pag_ago_2005',
                                        'PAY_AMT3':'valor_pag_jul_2005',
                                        'PAY_AMT4':'valor_pag_jun_2005',
                                        'PAY_AMT5':'valor_pag_mai_2005',
                                        'PAY_AMT6':'valor_pag_abr_2005'})
dados_renamed

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,29996,220000,1,3,1,39,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,29997,150000,1,3,2,43,-1,-1,-1,-1,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,29998,30000,1,2,2,37,4,3,2,-1,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,29999,80000,1,3,1,41,1,-1,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,30000,50000,1,2,1,46,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

In [12]:
'''
Caso essa linha seja executada mais de uma vez, resultará em erro, pois a coluna
"default payment next month" já foi apagada
'''
#Excluindo uma coluna
                                    #inplace aplica as ações no DataFrame caso (True)
dados_renamed.drop("default payment next month", axis = 1, inplace = True) 
dados_renamed

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jul_2005,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005
0,1,20000,2,2,1,24,2,2,-1,-1,...,689,0,0,0,0,689,0,0,0,0
1,2,120000,2,2,2,26,-1,2,0,0,...,2682,3272,3455,3261,0,1000,1000,1000,0,2000
2,3,90000,2,2,2,34,0,0,0,0,...,13559,14331,14948,15549,1518,1500,1000,1000,1000,5000
3,4,50000,2,2,1,37,0,0,0,0,...,49291,28314,28959,29547,2000,2019,1200,1100,1069,1000
4,5,50000,1,2,1,57,-1,0,-1,0,...,35835,20940,19146,19131,2000,36681,10000,9000,689,679
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,29996,220000,1,3,1,39,0,0,0,0,...,208365,88004,31237,15980,8500,20000,5003,3047,5000,1000
29996,29997,150000,1,3,2,43,-1,-1,-1,-1,...,3502,8979,5190,0,1837,3526,8998,129,0,0
29997,29998,30000,1,2,2,37,4,3,2,-1,...,2758,20878,20582,19357,0,0,22000,4200,2000,3100
29998,29999,80000,1,3,1,41,1,-1,0,0,...,76304,52774,11855,48944,85900,3409,1178,1926,52964,1804
29999,30000,50000,1,2,1,46,0,0,0,0,...,49764,36535,32428,15313,2078,1800,1430,1000,1000,1000

In [13]:
#Salvando dados do DataFrame em arquivo
dados_renamed.to_excel("Arquivos da Aplicação/Resultado.xlsx")

In [14]:
#Acessando rotulo das linhas
dados_renamed.index

RangeIndex(start=0, stop=30000, step=1)

In [15]:
#Acessando rotulo das colunas
dados_renamed.columns

Index(['ID', 'valor_credito', 'sexo', 'escolaridade', 'estado_civil', 'idade',
       'status_pag_set_2005', 'status_pag_ago_2005', 'status_pag_jul_2005',
       'status_pag_jun_2005', 'status_pag_mai_2005', 'status_pag_abr_2005',
       'extrato_set_2005', 'extrato_ago_2005', 'extrato_jul_2005',
       'extrato_jun_2005', 'extrato_mai_2005', 'extrato_abr_2005',
       'valor_pag_set_2005', 'valor_pag_ago_2005', 'valor_pag_jul_2005',
       'valor_pag_jun_2005', 'valor_pag_mai_2005', 'valor_pag_abr_2005'],
      dtype='object')

In [16]:
#Acessando rotulo das colunas de outra forma
dados_renamed.keys()

Index(['ID', 'valor_credito', 'sexo', 'escolaridade', 'estado_civil', 'idade',
       'status_pag_set_2005', 'status_pag_ago_2005', 'status_pag_jul_2005',
       'status_pag_jun_2005', 'status_pag_mai_2005', 'status_pag_abr_2005',
       'extrato_set_2005', 'extrato_ago_2005', 'extrato_jul_2005',
       'extrato_jun_2005', 'extrato_mai_2005', 'extrato_abr_2005',
       'valor_pag_set_2005', 'valor_pag_ago_2005', 'valor_pag_jul_2005',
       'valor_pag_jun_2005', 'valor_pag_mai_2005', 'valor_pag_abr_2005'],
      dtype='object')

In [17]:
#Identificando os valores do DataSet a partir de um objeto ndarray
dados_renamed.values

array([[     1,  20000,      2, ...,      0,      0,      0],
       [     2, 120000,      2, ...,   1000,      0,   2000],
       [     3,  90000,      2, ...,   1000,   1000,   5000],
       ...,
       [ 29998,  30000,      1, ...,   4200,   2000,   3100],
       [ 29999,  80000,      1, ...,   1926,  52964,   1804],
       [ 30000,  50000,      1, ...,   1000,   1000,   1000]], dtype=int64)

In [18]:
#Identificando os valores do DataSet a partir de um objeto ndarray de outra forma
dados_renamed.to_numpy()

array([[     1,  20000,      2, ...,      0,      0,      0],
       [     2, 120000,      2, ...,   1000,      0,   2000],
       [     3,  90000,      2, ...,   1000,   1000,   5000],
       ...,
       [ 29998,  30000,      1, ...,   4200,   2000,   3100],
       [ 29999,  80000,      1, ...,   1926,  52964,   1804],
       [ 30000,  50000,      1, ...,   1000,   1000,   1000]], dtype=int64)

In [19]:
#Identificando os tipos de dados contidos em cada coluna
dados_renamed.dtypes

ID                     int64
valor_credito          int64
sexo                   int64
escolaridade           int64
estado_civil           int64
idade                  int64
status_pag_set_2005    int64
status_pag_ago_2005    int64
status_pag_jul_2005    int64
status_pag_jun_2005    int64
status_pag_mai_2005    int64
status_pag_abr_2005    int64
extrato_set_2005       int64
extrato_ago_2005       int64
extrato_jul_2005       int64
extrato_jun_2005       int64
extrato_mai_2005       int64
extrato_abr_2005       int64
valor_pag_set_2005     int64
valor_pag_ago_2005     int64
valor_pag_jul_2005     int64
valor_pag_jun_2005     int64
valor_pag_mai_2005     int64
valor_pag_abr_2005     int64
dtype: object

In [20]:
#tambem pode ser usado df.info() para mostrar mais especificações
dados_renamed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 24 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   30000 non-null  int64
 1   valor_credito        30000 non-null  int64
 2   sexo                 30000 non-null  int64
 3   escolaridade         30000 non-null  int64
 4   estado_civil         30000 non-null  int64
 5   idade                30000 non-null  int64
 6   status_pag_set_2005  30000 non-null  int64
 7   status_pag_ago_2005  30000 non-null  int64
 8   status_pag_jul_2005  30000 non-null  int64
 9   status_pag_jun_2005  30000 non-null  int64
 10  status_pag_mai_2005  30000 non-null  int64
 11  status_pag_abr_2005  30000 non-null  int64
 12  extrato_set_2005     30000 non-null  int64
 13  extrato_ago_2005     30000 non-null  int64
 14  extrato_jul_2005     30000 non-null  int64
 15  extrato_jun_2005     30000 non-null  int64
 16  extrato_mai_2005     30000 non-null  int64
 17  extrato_abr_2005     30000 non-null  int64
 18  valor_pag_set_2005   30000 non-null  int64
 19  valor_pag_ago_2005   30000 non-null  int64
 20  valor_pag_jul_2005   30000 non-null  int64
 21  valor_pag_jun_2005   30000 non-null  int64
 22  valor_pag_mai_2005   30000 non-null  int64
 23  valor_pag_abr_2005   30000 non-null  int64
dtypes: int64(24)
memory usage: 5.5 MB

In [21]:
'''
#Código pesado, caso queira executar, basta apagar  (\''' ) 

#Iterando linhas e colunas do DataFrame
for index, row in dados_renamed.iterrows():
    print(index)
    print (row)
    
'''

"\n#Código pesado, caso queira executar, basta apagar  (''' ) \n\n#Iterando linhas e colunas do DataFrame\nfor index, row in dados_renamed.iterrows():\n    print(index)\n    print (row)\n    \n"

#### Selecionar valores específicos de um DataFrame

In [22]:
#Acessando uma coluna
dados_renamed ['valor_credito']

0         20000
1        120000
2         90000
3         50000
4         50000
          ...
29995    220000
29996    150000
29997     30000
29998     80000
29999     50000
Name: valor_credito, Length: 30000, dtype: int64

In [23]:
#Com outra sintaxe
dados_renamed.valor_credito

0         20000
1        120000
2         90000
3         50000
4         50000
          ...
29995    220000
29996    150000
29997     30000
29998     80000
29999     50000
Name: valor_credito, Length: 30000, dtype: int64

In [24]:
#Acessando múltiplas colunas
dados_renamed[['valor_credito', 'escolaridade']]

       valor_credito  escolaridade
0              20000             2
1             120000             2
2              90000             2
3              50000             2
4              50000             2
...              ...           ...
29995         220000             3
29996         150000             3
29997          30000             2
29998          80000             3
29999          50000             2

[30000 rows x 2 columns]

In [25]:
#Filtrando colunas
dados_renamed.filter(like = 'jul')

       status_pag_jul_2005  extrato_jul_2005  valor_pag_jul_2005
0                       -1               689                   0
1                        0              2682                1000
2                        0             13559                1000
3                        0             49291                1200
4                       -1             35835               10000
...                    ...               ...                 ...
29995                    0            208365                5003
29996                   -1              3502                8998
29997                    2              2758               22000
29998                    0             76304                1178
29999                    0             49764                1430

[30000 rows x 3 columns]

O df.loc utiliza os índices ou rótulos dos eixos das linhas e colunas como forma de endereçar elementos.

In [26]:
#Acessando linhas com df.loc[]
dados_renamed.loc[0]

ID                         1
valor_credito          20000
sexo                       2
escolaridade               2
estado_civil               1
idade                     24
status_pag_set_2005        2
status_pag_ago_2005        2
status_pag_jul_2005       -1
status_pag_jun_2005       -1
status_pag_mai_2005       -2
status_pag_abr_2005       -2
extrato_set_2005        3913
extrato_ago_2005        3102
extrato_jul_2005         689
extrato_jun_2005           0
extrato_mai_2005           0
extrato_abr_2005           0
valor_pag_set_2005         0
valor_pag_ago_2005       689
valor_pag_jul_2005         0
valor_pag_jun_2005         0
valor_pag_mai_2005         0
valor_pag_abr_2005         0
Name: 0, dtype: int64

In [27]:
#Acessando múltiplas linhas com df.loc[]
dados_renamed.loc[0:5]

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jul_2005,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005
0,1,20000,2,2,1,24,2,2,-1,-1,...,689,0,0,0,0,689,0,0,0,0
1,2,120000,2,2,2,26,-1,2,0,0,...,2682,3272,3455,3261,0,1000,1000,1000,0,2000
2,3,90000,2,2,2,34,0,0,0,0,...,13559,14331,14948,15549,1518,1500,1000,1000,1000,5000
3,4,50000,2,2,1,37,0,0,0,0,...,49291,28314,28959,29547,2000,2019,1200,1100,1069,1000
4,5,50000,1,2,1,57,-1,0,-1,0,...,35835,20940,19146,19131,2000,36681,10000,9000,689,679
5,6,50000,1,1,2,37,0,0,0,0,...,57608,19394,19619,20024,2500,1815,657,1000,1000,800

In [28]:
#Acessando linhas e colunas com df.loc[]
dados_renamed.loc[0:2, ['valor_credito', 'sexo']]

   valor_credito  sexo
0          20000     2
1         120000     2
2          90000     2

Já o df.iloc utiliza números inteiros correspondentes á posição dos eixos

In [29]:
#Localizando itens a partir do índice
dados_renamed.iloc[3:10, 3:6] #Primeiro parâmentro é das linhas o segundo das colunas, separados por ","

   escolaridade  estado_civil  idade
3             2             1     37
4             2             1     57
5             1             2     37
6             1             2     29
7             2             2     23
8             3             1     28
9             3             2     35

In [49]:
#Acessar linha apartir de máscaras booleanas
dados_renamed[dados_renamed["escolaridade"] == 1]

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jul_2005,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005
5,6,50000,1,1,2,37,0,0,0,0,...,57608,19394,19619,20024,2500,1815,657,1000,1000,800
6,7,500000,1,1,2,29,0,0,0,0,...,445007,542653,483003,473944,55000,40000,38000,20239,13750,13770
11,12,260000,2,1,2,51,-1,-1,-1,-1,...,9966,8517,22287,13668,21818,9966,8583,22301,0,3640
14,15,250000,1,1,2,29,0,0,0,0,...,63561,59696,56875,55512,3000,3000,3000,3000,3000,3000
16,17,20000,1,1,2,24,0,0,2,2,...,17428,18338,17905,19104,3200,0,1500,0,1650,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29986,29987,360000,1,1,2,35,-1,-1,-2,-2,...,0,0,0,0,0,0,0,0,0,0
29987,29988,130000,1,1,2,34,0,0,0,0,...,15546,108047,93708,97353,3000,2000,93000,4000,5027,4005
29988,29989,250000,1,1,1,34,0,0,0,0,...,243075,245750,175005,179687,65000,8800,9011,6000,7000,6009
29989,29990,150000,1,1,2,35,-1,-1,-1,-1,...,-3,780,0,0,9054,0,783,0,0,0
29993,29994,100000,1,1,2,38,0,-1,-1,0,...,102996,70626,69473,55004,2000,111784,4000,3000,2000,2000

#### Tratamento de dados

In [50]:
#Nova base de dados
credit = pd.read_csv(r"Arquivos da Aplicação\credit_card_clients_2.csv")
credit

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000.0,2.0,2.0,1.0,24.0,2.0,2.0,-1.0,-1.0,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1.0
1,2,120000.0,2.0,2.0,2.0,26.0,-1.0,2.0,0.0,0.0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1.0
2,3,90000.0,2.0,2.0,2.0,34.0,0.0,0.0,0.0,0.0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0.0
3,4,50000.0,2.0,2.0,1.0,37.0,0.0,0.0,0.0,0.0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0.0
4,5,50000.0,1.0,2.0,1.0,57.0,-1.0,0.0,-1.0,0.0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30012,30013,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30013,30014,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30014,30015,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30015,30016,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30016,30017,30018.0,29999.0,30000.0,5000.0,0.0,1.0,2.0,1.0,46.0,...,0.0,0.0,0.0,0.0,0.0,49764.0,36535.0,32428.0,15313.0,2078.0

In [57]:
#Renomeando colunas
credit = credit.rename(columns = {'LIMIT_BAL' : 'valor_credito',
                                        'SEX' : 'sexo',
                                        'EDUCATION' : 'escolaridade',
                                        'MARRIAGE':'estado_civil',
                                        'AGE':'idade',
                                        'PAY_0':'status_pag_set_2005',
                                        'PAY_2':'status_pag_ago_2005',
                                        'PAY_3':'status_pag_jul_2005',
                                        'PAY_4':'status_pag_jun_2005',
                                        'PAY_5':'status_pag_mai_2005',
                                        'PAY_6':'status_pag_abr_2005',
                                        'BILL_AMT1':'extrato_set_2005',
                                        'BILL_AMT2':'extrato_ago_2005',
                                        'BILL_AMT3':'extrato_jul_2005',
                                        'BILL_AMT4':'extrato_jun_2005',
                                        'BILL_AMT5':'extrato_mai_2005',
                                        'BILL_AMT6':'extrato_abr_2005',
                                        'PAY_AMT1':'valor_pag_set_2005',
                                        'PAY_AMT2':'valor_pag_ago_2005',
                                        'PAY_AMT3':'valor_pag_jul_2005',
                                        'PAY_AMT4':'valor_pag_jun_2005',
                                        'PAY_AMT5':'valor_pag_mai_2005',
                                        'PAY_AMT6':'valor_pag_abr_2005'})

In [58]:
#Verificando valores não nulos, caso queira ver os itens que não são nulos "df.isnull()
credit.notnull().sum()

ID                            30017
valor_credito                 30003
sexo                          30003
escolaridade                  30003
estado_civil                  30003
idade                         30003
status_pag_set_2005           30003
status_pag_ago_2005           30003
status_pag_jul_2005           30003
status_pag_jun_2005           30003
status_pag_mai_2005           30003
status_pag_abr_2005           30003
extrato_set_2005              30003
extrato_ago_2005              30003
extrato_jul_2005              30003
extrato_jun_2005              30003
extrato_mai_2005              30003
extrato_abr_2005              30003
valor_pag_set_2005            30003
valor_pag_ago_2005            30003
valor_pag_jul_2005            30003
valor_pag_jun_2005            30003
valor_pag_mai_2005            30003
valor_pag_abr_2005            30003
default payment next month    30003
dtype: int64

In [59]:
#Verificando Valores não nulos usando df.info()
credit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30017 entries, 0 to 30016
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30017 non-null  int64
 1   valor_credito               30003 non-null  float64
 2   sexo                        30003 non-null  float64
 3   escolaridade                30003 non-null  float64
 4   estado_civil                30003 non-null  float64
 5   idade                       30003 non-null  float64
 6   status_pag_set_2005         30003 non-null  float64
 7   status_pag_ago_2005         30003 non-null  float64
 8   status_pag_jul_2005         30003 non-null  float64
 9   status_pag_jun_2005         30003 non-null  float64
 10  status_pag_mai_2005         30003 non-null  float64
 11  status_pag_abr_2005         30003 non-null  float64
 12  extrato_set_2005            30003 non-null  float64
 13  extrato_ago_2005            30003 non-null  float64
 14  extrato_jul_2005            30003 non-null  float64
 15  extrato_jun_2005            30003 non-null  float64
 16  extrato_mai_2005            30003 non-null  float64
 17  extrato_abr_2005            30003 non-null  float64
 18  valor_pag_set_2005          30003 non-null  float64
 19  valor_pag_ago_2005          30003 non-null  float64
 20  valor_pag_jul_2005          30003 non-null  float64
 21  valor_pag_jun_2005          30003 non-null  float64
 22  valor_pag_mai_2005          30003 non-null  float64
 23  valor_pag_abr_2005          30003 non-null  float64
 24  default payment next month  30003 non-null  float64
dtypes: float64(24), int64(1)
memory usage: 5.7 MB

In [60]:
#Valores nulos no DataFrame em booleano"
credit.isnull().sum()

ID                             0
valor_credito                 14
sexo                          14
escolaridade                  14
estado_civil                  14
idade                         14
status_pag_set_2005           14
status_pag_ago_2005           14
status_pag_jul_2005           14
status_pag_jun_2005           14
status_pag_mai_2005           14
status_pag_abr_2005           14
extrato_set_2005              14
extrato_ago_2005              14
extrato_jul_2005              14
extrato_jun_2005              14
extrato_mai_2005              14
extrato_abr_2005              14
valor_pag_set_2005            14
valor_pag_ago_2005            14
valor_pag_jul_2005            14
valor_pag_jun_2005            14
valor_pag_mai_2005            14
valor_pag_abr_2005            14
default payment next month    14
dtype: int64

In [61]:
#Filtrando valores nulos
credit[credit['ID'].isnull()]

Empty DataFrame
Columns: [ID, valor_credito, sexo, escolaridade, estado_civil, idade, status_pag_set_2005, status_pag_ago_2005, status_pag_jul_2005, status_pag_jun_2005, status_pag_mai_2005, status_pag_abr_2005, extrato_set_2005, extrato_ago_2005, extrato_jul_2005, extrato_jun_2005, extrato_mai_2005, extrato_abr_2005, valor_pag_set_2005, valor_pag_ago_2005, valor_pag_jul_2005, valor_pag_jun_2005, valor_pag_mai_2005, valor_pag_abr_2005, default payment next month]
Index: []

[0 rows x 25 columns]

In [62]:
#Excluido valores nulos
credit_notnull = credit[credit['valor_credito'].notna()]
credit_notnull

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005,default payment next month
0,1,20000.0,2.0,2.0,1.0,24.0,2.0,2.0,-1.0,-1.0,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1.0
1,2,120000.0,2.0,2.0,2.0,26.0,-1.0,2.0,0.0,0.0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1.0
2,3,90000.0,2.0,2.0,2.0,34.0,0.0,0.0,0.0,0.0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0.0
3,4,50000.0,2.0,2.0,1.0,37.0,0.0,0.0,0.0,0.0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0.0
4,5,50000.0,1.0,2.0,1.0,57.0,-1.0,0.0,-1.0,0.0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29998,29999,80000.0,1.0,3.0,1.0,41.0,1.0,-1.0,0.0,0.0,...,52774.0,11855.0,48944.0,85900.0,3409.0,1178.0,1926.0,52964.0,1804.0,1.0
29999,30000,50000.0,1.0,2.0,1.0,46.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15313.0,2078.0,1800.0,1430.0,1000.0,1000.0,1000.0,1.0
30000,30001,44000.0,2.0,1.0,2.0,33.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15323.0,2056.0,1800.0,1120.0,1000.0,1000.0,1000.0,1.0
30001,30002,43300.0,1.0,2.0,1.0,36.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15343.0,2034.0,1800.0,1650.0,1000.0,1000.0,2000.0,1.0
30016,30017,30018.0,29999.0,30000.0,5000.0,0.0,1.0,2.0,1.0,46.0,...,0.0,0.0,0.0,0.0,0.0,49764.0,36535.0,32428.0,15313.0,2078.0

In [63]:
#Outra forma de excluir valores nulos
credit.dropna(inplace = True) #"how ='all'" apagará a linha caso todas as colunas sejam nulas
                         #caso "how ='any'" apagará a linha onde alguma coluna for nula
credit

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005,default payment next month
0,1,20000.0,2.0,2.0,1.0,24.0,2.0,2.0,-1.0,-1.0,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1.0
1,2,120000.0,2.0,2.0,2.0,26.0,-1.0,2.0,0.0,0.0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1.0
2,3,90000.0,2.0,2.0,2.0,34.0,0.0,0.0,0.0,0.0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0.0
3,4,50000.0,2.0,2.0,1.0,37.0,0.0,0.0,0.0,0.0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0.0
4,5,50000.0,1.0,2.0,1.0,57.0,-1.0,0.0,-1.0,0.0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29998,29999,80000.0,1.0,3.0,1.0,41.0,1.0,-1.0,0.0,0.0,...,52774.0,11855.0,48944.0,85900.0,3409.0,1178.0,1926.0,52964.0,1804.0,1.0
29999,30000,50000.0,1.0,2.0,1.0,46.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15313.0,2078.0,1800.0,1430.0,1000.0,1000.0,1000.0,1.0
30000,30001,44000.0,2.0,1.0,2.0,33.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15323.0,2056.0,1800.0,1120.0,1000.0,1000.0,1000.0,1.0
30001,30002,43300.0,1.0,2.0,1.0,36.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15343.0,2034.0,1800.0,1650.0,1000.0,1000.0,2000.0,1.0
30016,30017,30018.0,29999.0,30000.0,5000.0,0.0,1.0,2.0,1.0,46.0,...,0.0,0.0,0.0,0.0,0.0,49764.0,36535.0,32428.0,15313.0,2078.0

O df.drop_duplicates serve para remover duplicatas do DataFrame e recebe os seguintes parâmetros:

       .subset= :especifica uma coluna ou lista de rótulos de colunas. 
           Valor padrão = None

       .keep= :serve para controlar o que considerar valor duplicado:

            first: descarta duplicatas, exceto a primeira ocorrência de cada.

            last: descarta duplicatas, exceto a úlitma ocorrência de cada.

            False: elimina TODAS as duplicatas.


       .inplace= : recebe valores booleanos e remove as linhas que forem duplicadas 
       diretamente no DataFrame caso True

In [64]:
#Removendo dados duplicados
credit.drop_duplicates(subset = 'ID', keep = 'first', inplace = True)
credit

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005,default payment next month
0,1,20000.0,2.0,2.0,1.0,24.0,2.0,2.0,-1.0,-1.0,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1.0
1,2,120000.0,2.0,2.0,2.0,26.0,-1.0,2.0,0.0,0.0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1.0
2,3,90000.0,2.0,2.0,2.0,34.0,0.0,0.0,0.0,0.0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0.0
3,4,50000.0,2.0,2.0,1.0,37.0,0.0,0.0,0.0,0.0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0.0
4,5,50000.0,1.0,2.0,1.0,57.0,-1.0,0.0,-1.0,0.0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29998,29999,80000.0,1.0,3.0,1.0,41.0,1.0,-1.0,0.0,0.0,...,52774.0,11855.0,48944.0,85900.0,3409.0,1178.0,1926.0,52964.0,1804.0,1.0
29999,30000,50000.0,1.0,2.0,1.0,46.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15313.0,2078.0,1800.0,1430.0,1000.0,1000.0,1000.0,1.0
30000,30001,44000.0,2.0,1.0,2.0,33.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15323.0,2056.0,1800.0,1120.0,1000.0,1000.0,1000.0,1.0
30001,30002,43300.0,1.0,2.0,1.0,36.0,0.0,0.0,0.0,0.0,...,36535.0,32428.0,15343.0,2034.0,1800.0,1650.0,1000.0,1000.0,2000.0,1.0
30016,30017,30018.0,29999.0,30000.0,5000.0,0.0,1.0,2.0,1.0,46.0,...,0.0,0.0,0.0,0.0,0.0,49764.0,36535.0,32428.0,15313.0,2078.0

In [65]:
#Agrupando dados com .groupby()
credit_grouped = credit.groupby(["escolaridade"]).mean().reset_index()
credit_grouped

,escolaridade,ID,valor_credito,sexo,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005,default payment next month
0,0.0,17091.357143,217142.857143,1.428571,1.714286,38.857143,-0.500000,-1.000000,-0.928571,-0.857143,...,13350.214286,7409.071429,5272.928571,5945.785714,13030.928571,8825.142857,3620.571429,2541.714286,3007.214286,0.000000
1,1.0,14698.657850,212940.109579,1.588702,1.652371,34.231721,-0.233894,-0.408086,-0.425845,-0.461931,...,42930.460986,40388.139241,38665.870773,6780.487247,7306.102022,6560.071793,5804.111751,5776.110996,6422.042603,0.192424
2,2.0,15025.305253,147055.042406,1.616920,1.522985,34.722187,0.102202,0.022522,-0.018530,-0.083030,...,44748.194355,41587.913406,40430.155727,5080.246169,5106.475661,4556.592830,4375.146746,4452.432613,4716.293422,0.237403
3,3.0,15342.314013,126550.270490,1.595282,1.421192,40.299980,0.132805,0.040879,0.002644,-0.066504,...,38718.582266,35957.469392,34704.597315,4866.397397,5053.454139,3964.056742,3992.658532,3599.658938,3825.749034,0.251576
4,4.0,18143.447154,220894.308943,1.658537,1.601626,33.853659,-0.504065,-0.772358,-0.764228,-0.813008,...,39570.268293,33840.113821,32136.130081,5450.512195,6555.008130,9990.626016,5104.861789,5991.642276,4284.967480,0.056911
5,5.0,17443.664286,168164.285714,1.660714,1.475000,35.600000,-0.121429,-0.303571,-0.375000,-0.375000,...,62275.767857,53568.014286,46083.860714,5970.714286,8912.921429,7718.510714,4927.332143,4633.246429,7772.114286,0.064286
6,6.0,16895.019608,148235.294118,1.509804,1.490196,43.901961,-0.176471,-0.313725,-0.372549,-0.411765,...,54259.490196,44510.745098,39578.509804,9780.450980,6176.431373,7644.941176,5179.490196,11691.137255,14773.901961,0.156863
7,30000.0,30017.000000,30018.000000,29999.000000,5000.000000,0.000000,1.000000,2.000000,1.000000,46.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,49764.000000,36535.000000,32428.000000,15313.000000,2078.000000

In [66]:
#Extraindo um sumário das estatísticas descritivas
credit.describe()

,ID,valor_credito,sexo,escolaridade,estado_civil,idade,status_pag_set_2005,status_pag_ago_2005,status_pag_jul_2005,status_pag_jun_2005,...,extrato_jun_2005,extrato_mai_2005,extrato_abr_2005,valor_pag_set_2005,valor_pag_ago_2005,valor_pag_jul_2005,valor_pag_jun_2005,valor_pag_mai_2005,valor_pag_abr_2005,default payment next month
count,30003.000000,30003.000000,30003.00000,30003.000000,30003.000000,30003.000000,30003.000000,30003.000000,30003.000000,30003.000000,...,30003.000000,30003.000000,30003.000000,30003.000000,3.000300e+04,30003.000000,30003.000000,30003.000000,30003.000000,30003.000000
mean,15002.000467,167471.486118,2.60354,2.852948,1.718461,35.484252,-0.016665,-0.133687,-0.166150,-0.219111,...,43261.058527,40309.531880,38868.895710,5663.150518,5.920691e+03,5226.909942,4826.878679,4800.055228,5215.591441,0.290504
std,8661.265208,129747.540674,173.18208,173.187526,28.861831,9.219731,1.123761,1.197190,1.196827,1.199148,...,64330.147936,60794.595547,59551.862862,16562.510846,2.303977e+04,17607.986765,15666.477207,15278.405942,17776.698879,12.002641
min,1.000000,10000.000000,1.00000,0.000000,0.000000,0.000000,-2.000000,-2.000000,-2.000000,-2.000000,...,-170000.000000,-81334.000000,-339603.000000,0.000000,0.000000e+00,0.000000,0.000000,0.000000,0.000000,0.000000
25%,7501.500000,50000.000000,1.00000,1.000000,1.000000,28.000000,-1.000000,-1.000000,-1.000000,-1.000000,...,2326.500000,1763.000000,1256.000000,1000.000000,8.330000e+02,390.000000,296.000000,253.500000,118.000000,0.000000
50%,15002.000000,140000.000000,2.00000,2.000000,2.000000,34.000000,0.000000,0.000000,0.000000,0.000000,...,19052.000000,18105.000000,17068.000000,2100.000000,2.009000e+03,1800.000000,1500.000000,1500.000000,1500.000000,0.000000
75%,22502.500000,240000.000000,2.00000,2.000000,2.000000,41.000000,0.000000,0.000000,0.000000,0.000000,...,54494.500000,50182.500000,49183.500000,5006.000000,5.000000e+03,4505.000000,4013.500000,4032.000000,4000.000000,0.000000
max,30017.000000,1000000.000000,29999.00000,30000.000000,5000.000000,79.000000,8.000000,8.000000,8.000000,46.000000,...,891586.000000,927171.000000,961664.000000,873552.000000,1.684259e+06,896040.000000,621000.000000,426529.000000,528666.000000,2078.000000

In [67]:
#Extraindo um sumário das estatísticas descritivas de uma coluna específica 
credit['extrato_set_2005'].describe()

count     30003.000000
mean      51221.404026
std       73632.777686
min     -165580.000000
25%        3558.500000
50%       22382.000000
75%       67089.000000
max      964511.000000
Name: extrato_set_2005, dtype: float64

In [68]:
#Calculando média da coluna valor_credito
credit.valor_credito.mean()

167471.48611805486

In [69]:
#Calculando mediana da coluna valor_credito
credit.valor_credito.median()

140000.0

In [70]:
#Calculando a moda da coluna valor_credito
credit.valor_credito.mode()

0    50000.0
dtype: float64

Variância:

    A variância (V) é útil para determinar o afastamento da média que os dados de um conjunto analisado apresentam
Desvio Padrão:

    O desvio padrão (DP) é calculado a partir da variância, pois é a raiz quadrada desse parâmetro.

In [71]:
#Calculando a Variância 
credit.valor_credito.var()

16834424311.01541

In [72]:
#Calculando o Desvio Padrão
credit.valor_credito.std()

129747.54067424711